web/app/views/admin/raw_videos/show.html.erb

</tr>
<% @video.raw_video_streams.each do |stream| %>
---
SELECT `raw_video_streams`.* FROM `raw_video_streams` WHERE (`raw_video_streams`.raw_video_id = 1)

</tr>
<% @video.clips.each do |clip| %>
---
SELECT `clips`.* FROM `clips` WHERE (`clips`.raw_video_id = 1)