web/app/controllers/admin/admin_tasks_controller.rb

SELECT `raw_videos`.* FROM `raw_videos` WHERE (`raw_videos`.`id` = 4) LIMIT 1
---
    def new
        if params[:type] == "transcoding"
            @task = TranscodingTask.new(:status => "new")
            @video = RawVideo.find(params[:raw_video_id])

SELECT `raw_videos`.* FROM `raw_videos` WHERE (`raw_videos`.`id` = 4) LIMIT 1
---
    def create
        if params[:type] == "transcoding"
            @task = TranscodingTask.new(:status => "new", :raw_videos_id => params["raw_video_id"], :bitrate => params["bitrate"])
        elsif params[:type] == "package"
            @task = PackageTask.new(:status => "new", :location => params["location"])
        else
            @task = AdminTask.new
        end

        if @task.type.nil?
            @task.errors["Error"] = "Wrong parameter(type)."
            render :action => "new"
            return
        end

        if @task.type == "TranscodingTask"
            video = RawVideo.find(params["raw_video_id"])

SELECT `admin_tasks`.* FROM `admin_tasks` WHERE (`admin_tasks`.`id` = 1) LIMIT 1
DELETE FROM `admin_tasks` WHERE (`admin_tasks`.`type` = 'PackageTask') AND (`admin_tasks`.`id` = 1)
---
    def destroy
        @task = AdminTask.find(params[:id])
        @task.destroy