web/app/controllers/admin/admins_controller.rb

    def index
        @packages = Package.all
---
SELECT `packages`.* FROM `packages`