web/app/controllers/admin/clips_controller.rb

    def show
        @clip = Clip.find(params[:id])
---
SELECT `clips`.* FROM `clips` WHERE (`clips`.`id` = 1) LIMIT 1

    def stream
        @clip = Clip.find(params[:id])
---
SELECT `clips`.* FROM `clips` WHERE (`clips`.`id` = 1) LIMIT 1