web/app/controllers/admin/packages_controller.rb

SELECT `packages`.* FROM `packages`
---
  def index
    @packages = Package.all

SELECT `packages`.* FROM `packages` WHERE (`packages`.`id` = 5) LIMIT 1
---
  def show
    @package = Package.find(params[:id])

SELECT `packages`.* FROM `packages` WHERE (`packages`.`id` = 5) LIMIT 1
---
  def edit
    @package = Package.find(params[:id])

INSERT INTO `packages` (`created_at`, `location`, `status`, `updated_at`) VALUES ('2010-10-20 15:57:31', NULL, NULL, '2010-10-20 15:57:31')
---
  def create
    @package = Package.new
    @task = PackageTask.new(:status => "new")

    respond_to do |format|
      if (File.directory?(params[:location]) or Video.is_video?(params[:location])) and @task.save

SELECT `packages`.* FROM `packages` WHERE (`packages`.`id` = 4) LIMIT 1
---
  def update
    @package = Package.find(params[:id])

SELECT `packages`.* FROM `packages` WHERE (`packages`.`id` = 1) LIMIT 1
DELETE FROM `packages` WHERE (`packages`.`id` = 1)
---
  def destroy
    @package = Package.find(params[:id])
    @package.destroy