web/app/controllers/admin/raw_videos_controller.rb

  def index
    @raw_videos = RawVideo.all
---
SELECT `raw_videos`.* FROM `raw_videos`

  def show
    @raw_video = RawVideo.find(params[:id])
---
SELECT `raw_videos`.* FROM `raw_videos` WHERE (`raw_videos`.`id` = 4) LIMIT 1