web/app/controllers/admin/video_resources_controller.rb

SELECT `video_resources`.* FROM `video_resources`
---
  def index
    @video_resources = VideoResource.all