web/app/views/admin/admins/index.html.erb

SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `raw_videos` WHERE (`raw_videos`.package_id = 1)) AS subquery
---
        <td><%= link_to package.location, [:admin, package] %></td>
        <td><% if package.raw_videos.nil? %> 0 <% else %> <%= package.raw_videos.size %> <% end %>