web/app/views/admin/packages/show.html.erb

SELECT `raw_videos`.* FROM `raw_videos` WHERE (`raw_videos`.package_id = 1)
---
    </tr>
    <% @package.raw_videos.each do |video| %>